# SetLBItemData

## Description
Sets the user data associated with the list browser item.

```pascal
PROCEDURE SetLBItemData(
				nDialogID     : LONGINT;
				nComponentID  : LONGINT;
				nItemIndex    : INTEGER;
				nSubItemIndex : INTEGER;
				nUserData     : LONGINT);
```

```python
def vs.SetLBItemData(nDialogID, nComponentID, nItemIndex, nSubItemIndex, nUserData):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT|   |
|nComponentID|LONGINT|   |
|nItemIndex|INTEGER|   |
|nSubItemIndex|INTEGER|   |
|nUserData|LONGINT|   |

## Version
Availability: from VectorWorks12.5

## Category
* Dialogs - Modern - Browser